In [2]:
import numpy as np
import pandas as pd
from google.cloud import bigquery

In [3]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]= "C:/Users/erycm/Documents/teste_tecnico_indicium/data/indicium-349201-330650f022bd.json"

client = bigquery.Client()
table_dataset = 'indicium-349201.Northwind'

In [4]:
suppliers = pd.read_csv('data/suppliers.csv', sep=";")
employees = pd.read_csv('data/employees.csv', sep=";")
customers = pd.read_csv('data/customers.csv', sep=";")
products = pd.read_csv('data/products.csv', sep=";")
shippers = pd.read_csv('data/shippers.csv', sep=";")
categories = pd.read_csv('data/categories.csv', sep=";")

us_states = pd.read_csv('data/us_states.csv', sep=";")
region = pd.read_csv('data/region.csv', sep=";")
territories = pd.read_csv('data/territories.csv', sep=";")
employee_territories = pd.read_csv('data/employee_territories.csv', sep=";")


orders = pd.read_csv('data/orders.csv', sep=";")
order_details = pd.read_csv('data/order_details.csv', sep=";")

# customer_demo = pd.read_csv('data/customer_customer_demo.csv', sep=";") (empty)
# customer_demographics = pd.read_csv('data/customer_demographics.csv', sep=";") (empty)

# Exploração dos dados e criação do dataset

## Suppliers

In [4]:
suppliers_table = table_dataset+'.'+'suppliers'

In [5]:
suppliers.head(1)

,supplier_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax,homepage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,NaN,EC1 4SD,UK,(171) 555-2222,NaN,NaN

In [6]:
schema = [
    bigquery.SchemaField("supplier_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("company_name", "STRING"),
    bigquery.SchemaField("contact_name", "STRING"),
    bigquery.SchemaField("contact_title", "STRING"),
    bigquery.SchemaField("address", "STRING"),
    bigquery.SchemaField("city", "STRING"),
    bigquery.SchemaField("region", "STRING"),
    bigquery.SchemaField("postal_code", "STRING"),
    bigquery.SchemaField("country", "STRING"),
    bigquery.SchemaField("phone", "STRING"),
    bigquery.SchemaField("fax", "STRING"),
    bigquery.SchemaField("homepage", "STRING"),
]

table = bigquery.Table(suppliers_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(suppliers, suppliers_table)

Created table indicium-349201.Northwind.suppliers

LoadJob<project=indicium-349201, location=US, id=08cbccf0-4759-44bd-abe9-94975f64c6e8>

## Employees

In [7]:
employees_table = table_dataset+'.'+'employees'

In [8]:
employees["reports_to"] = employees["reports_to"].fillna(-1).astype(int)
employees["employee_id"] = employees["employee_id"].astype(int)
employees["extension"] = employees["extension"].astype(int)
employees["postal_code"] = employees["postal_code"].astype(str)
employees['birth_date'] = pd.to_datetime(employees['birth_date'], format='%Y-%m-%d')
employees['hire_date'] = pd.to_datetime(employees['hire_date'], format='%Y-%m-%d')
employees.head(1)

,employee_id,last_name,first_name,title,title_of_courtesy,birth_date,hire_date,address,city,region,postal_code,country,home_phone,extension,photo,notes,reports_to,photo_path
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08,1992-05-01,507 - 20th Ave. E.\nApt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,\x,Education includes a BA in psychology from Col...,2,http://accweb/emmployees/davolio.bmp

In [9]:
schema = [
    bigquery.SchemaField("employee_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("last_name", "STRING"),
    bigquery.SchemaField("first_name", "STRING"),
    bigquery.SchemaField("title", "STRING"),
    bigquery.SchemaField("title_of_courtesy", "STRING"),
    bigquery.SchemaField("birth_date", "DATE"),
    bigquery.SchemaField("hire_date", "DATE"), 
    bigquery.SchemaField("address", "STRING"),
    bigquery.SchemaField("city", "STRING"),
    bigquery.SchemaField("region", "STRING"),
    bigquery.SchemaField("postal_code", "STRING"),
    bigquery.SchemaField("country", "STRING"),
    bigquery.SchemaField("home_phone", "STRING"),
    bigquery.SchemaField("extension", "INTEGER"),
    bigquery.SchemaField("photo", "STRING"),
    bigquery.SchemaField("notes", "STRING"),
    bigquery.SchemaField("reports_to", "INTEGER"),
    bigquery.SchemaField("photo_path", "STRING"),
]

table = bigquery.Table(employees_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
)

Created table indicium-349201.Northwind.employees

In [10]:
client.load_table_from_dataframe(employees, employees_table)

LoadJob<project=indicium-349201, location=US, id=772dbc67-55f8-47be-a888-dac75c11a052>

## Customers

In [11]:
customers_table = table_dataset+'.'+'customers'

In [12]:
customers.head(1)

,customer_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545

In [13]:
schema = [
    bigquery.SchemaField("customer_id", "STRING", mode="REQUIRED"),
    bigquery.SchemaField("company_name", "STRING"),
    bigquery.SchemaField("contact_name", "STRING"),
    bigquery.SchemaField("contact_title", "STRING"),
    bigquery.SchemaField("address", "STRING"),
    bigquery.SchemaField("city", "STRING"),
    bigquery.SchemaField("region", "STRING"),
    bigquery.SchemaField("postal_code", "STRING"),
    bigquery.SchemaField("country", "STRING"),
    bigquery.SchemaField("phone", "STRING"),
    bigquery.SchemaField("fax", "STRING"),
]

table = bigquery.Table(customers_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(customers, customers_table)

Created table indicium-349201.Northwind.customers

LoadJob<project=indicium-349201, location=US, id=c355125a-b4d5-446e-9e82-9e77b082c49e>

## Products

In [14]:
products_table = table_dataset+'.'+'products'

In [15]:
products.head(1)

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
0,1,Chai,8,1,10 boxes x 30 bags,18.0,39,0,10,1

##

In [16]:
schema = [
    bigquery.SchemaField("product_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("product_name", "STRING"),
    bigquery.SchemaField("supplier_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("category_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("quantity_per_unit", "STRING"),
    bigquery.SchemaField("unit_price", "FLOAT"),
    bigquery.SchemaField("units_in_stock", "INTEGER"),
    bigquery.SchemaField("units_on_order", "INTEGER"),
    bigquery.SchemaField("reorder_level", "INTEGER"),
    bigquery.SchemaField("discontinued", "INTEGER"),
]

table = bigquery.Table(products_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(products, products_table)

Created table indicium-349201.Northwind.products

LoadJob<project=indicium-349201, location=US, id=e178b906-6035-4193-85d1-a1954e07fc86>

## Shippers

In [17]:
shippers_table = table_dataset+'.'+'shippers'

In [18]:
shippers.head(1)

   shipper_id    company_name           phone
0           1  Speedy Express  (503) 555-9831

In [19]:
schema = [
    bigquery.SchemaField("shipper_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("company_name", "STRING"),
    bigquery.SchemaField("phone", "STRING"),
]

table = bigquery.Table(shippers_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(shippers, shippers_table)

Created table indicium-349201.Northwind.shippers

LoadJob<project=indicium-349201, location=US, id=dfd40767-48c9-4eba-b64c-d0f225824fd3>

## Categories

In [20]:
categories_table = table_dataset+'.'+'categories'

In [21]:
categories.head(1)

,category_id,category_name,description,picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",\x

In [22]:
schema = [
    bigquery.SchemaField("category_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("category_name", "STRING"),
    bigquery.SchemaField("description", "STRING"),
    bigquery.SchemaField("picture", "STRING"),
]

table = bigquery.Table(categories_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(categories, categories_table)

Created table indicium-349201.Northwind.categories

LoadJob<project=indicium-349201, location=US, id=bc3aa701-186b-4b2f-bcfa-0c82400d4d87>

## US States

In [23]:
us_states_table = table_dataset+'.'+'us_states'

In [24]:
us_states.head(1)

   state_id state_name state_abbr state_region
0         1    Alabama         AL        south

In [25]:
schema = [
    bigquery.SchemaField("state_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("state_name", "STRING"),
    bigquery.SchemaField("state_abbr", "STRING"),
    bigquery.SchemaField("state_region", "STRING"),
]

table = bigquery.Table(us_states_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(us_states, us_states_table)

Created table indicium-349201.Northwind.us_states

LoadJob<project=indicium-349201, location=US, id=dc304df4-3d37-4a5c-a2af-dc3249dda0af>

## Region

In [26]:
region_table = table_dataset+'.'+'region'

In [27]:
region.head(1)

   region_id region_description
0          1            Eastern

In [28]:
schema = [
    bigquery.SchemaField("region_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("region_description", "STRING"),
]

table = bigquery.Table(region_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(region, region_table)

Created table indicium-349201.Northwind.region

LoadJob<project=indicium-349201, location=US, id=1687794d-73d3-4079-8f26-038d86bfe373>

## Territories

In [29]:
territories_table = table_dataset+'.'+'territories'

In [30]:
territories.head(1)

   territory_id territory_description  region_id
0          1581              Westboro          1

In [31]:
schema = [
    bigquery.SchemaField("territory_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("territory_description", "STRING"),
    bigquery.SchemaField("region_id", "INTEGER", mode="REQUIRED"),
]

table = bigquery.Table(territories_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(territories, territories_table)

Created table indicium-349201.Northwind.territories

LoadJob<project=indicium-349201, location=US, id=fc1bafbb-81dc-46f8-b457-ede46d3b2c34>

## Employee Territories

In [32]:
employee_territories_table = table_dataset+'.'+'employee_territories'

In [33]:
employee_territories.head(1)

   employee_id  territory_id
0            1          6897

In [34]:
schema = [
    bigquery.SchemaField("employee_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("territory_id", "INTEGER", mode="REQUIRED"),
]

table = bigquery.Table(employee_territories_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(employee_territories, employee_territories_table)

Created table indicium-349201.Northwind.employee_territories

LoadJob<project=indicium-349201, location=US, id=cd3d3174-abec-4cd3-b2c2-47b631232acd>

## Orders

In [35]:
orders_table = table_dataset+'.'+'orders'

In [36]:
orders['order_date'] = pd.to_datetime(orders['order_date'], format='%Y-%m-%d')
orders['required_date'] = pd.to_datetime(orders['required_date'], format='%Y-%m-%d')
orders['shipped_date'] = pd.to_datetime(orders['shipped_date'], format='%Y-%m-%d')
orders.head(1)

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,NaN,51100,France

In [37]:
schema = [
    bigquery.SchemaField("order_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("customer_id", "STRING", mode="REQUIRED"),
    bigquery.SchemaField("employee_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("order_date", "DATE"),
    bigquery.SchemaField("required_date", "DATE"),
    bigquery.SchemaField("shipped_date", "DATE"),
    bigquery.SchemaField("ship_via", "INTEGER"),
    bigquery.SchemaField("freight", "FLOAT"),
    bigquery.SchemaField("ship_name", "STRING"),
    bigquery.SchemaField("ship_address", "STRING"),
    bigquery.SchemaField("ship_city", "STRING"),
    bigquery.SchemaField("ship_region", "STRING"),
    bigquery.SchemaField("ship_postal_code", "STRING"),
    bigquery.SchemaField("ship_country", "STRING"),
]

table = bigquery.Table(orders_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(orders, orders_table)

Created table indicium-349201.Northwind.orders

LoadJob<project=indicium-349201, location=US, id=a5eb3ae6-d733-423a-a7f0-7e4220bff0f9>

## Order Details

In [38]:
order_details_table = table_dataset+'.'+'order_details'

In [39]:
order_details.head(1)

   order_id  product_id  unit_price  quantity  discount
0     10248          11        14.0        12       0.0

In [40]:
schema = [
    bigquery.SchemaField("order_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("product_id", "INTEGER", mode="REQUIRED"),
    bigquery.SchemaField("unit_price", "FLOAT"),
    bigquery.SchemaField("quantity", "INTEGER"),
    bigquery.SchemaField("discount", "FLOAT"),
]

table = bigquery.Table(order_details_table, schema=schema)
table = client.create_table(table)
print(
    "Created table {}.{}.{}".format(table.project, table.dataset_id, table.table_id)
) 
client.load_table_from_dataframe(order_details, order_details_table)

Created table indicium-349201.Northwind.order_details

LoadJob<project=indicium-349201, location=US, id=f73741fb-2597-4ea5-af16-d74086a6099c>